load_test_output.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: load_test.js
     output: -

     ✓ status was 200
     ✗ duration was <=
      ↳  26% — ✓ 774 / ✗ 2202

     checks.........................: 63.00% ✓ 3750      ✗ 2202 
     data_received..................: 215 MB 1.9 MB/s
     data_sent......................: 924 kB 8.1 kB/s
     http_req_blocked...............: avg=21.8ms   min=2µs     med=6µs      max=3.23s  p(90)=9µs      p(95)=20µs 
     http_req_connecting............: avg=7.55ms   min=0s      med=0s       max=2.1s   p(90)=0s       p(95)=0s   
   ✗ http_req_duration..............: avg=854.24ms min=80.38ms med=689.07ms max=5.21s  p(90)=1.7s     p(95)=2.17s
       { expected_response:true }...: avg=854.24ms min=80.38ms med=689.07ms max=5.21s  p(90)=1.7s     p(95)=2.17s
   ✓ http_req_failed................: 0.00%  ✓ 0         ✗ 2976 
     http_req_receiving.............: avg=445.42ms min=4.12ms  med=331.52ms max=2.97s  p(90)=987.94ms p(95)=1.28s
     http_req_sending...............: avg=40.81µs  min=10µs    med=34µs     max=5.58ms p(90)=53µs     p(95)=67µs 
     http_req_tls_handshaking.......: avg=14.2ms   min=0s      med=0s       max=1.96s  p(90)=0s       p(95)=0s   
     http_req_waiting...............: avg=408.78ms min=37.28ms med=328.8ms  max=3.26s  p(90)=821.65ms p(95)=1.04s
     http_reqs......................: 2976   26.251684/s
     iteration_duration.............: avg=5.63s    min=3.29s   med=5.36s    max=12.85s p(90)=8.13s    p(95)=9.35s
     iterations.....................: 992    8.750561/s
     vus............................: 3      min=1       max=100
     vus_max........................: 100    min=100     max=100


running (1m53.4s), 000/100 VUs, 992 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m50s